performance-testing/aggregate_light.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
01 - Load Homepage,50,6,5,7,7,38,4,38,0.000%,.26975,0.27,0.03
02 - Load React Bundle,50,6,6,8,8,13,4,13,0.000%,.26978,45.99,0.04
03 - Load CSS Bundle,50,6,6,8,8,9,5,9,0.000%,.26979,61.71,0.04
04 - Get Static Users,50,4,5,6,7,9,3,9,0.000%,.26978,0.13,0.04
05 - Get Conversations,50,48,48,51,52,55,43,55,0.000%,.26971,0.17,0.04
06 - Get Messages,50,136,136,143,145,179,121,179,0.000%,.26957,2.35,0.05
07 - Send Message,50,140,139,142,143,279,126,279,0.000%,.26957,0.07,0.07
TOTAL,350,49,7,139,141,148,3,279,0.000%,1.59562,93.52,0.26