performance-testing/summary_light.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
01 - Load Homepage,50,6,4,38,4.66,0.000%,.26975,0.27,0.03,1037.0
02 - Load React Bundle,50,6,4,13,1.64,0.000%,.26978,45.99,0.04,174553.0
03 - Load CSS Bundle,50,6,5,9,1.00,0.000%,.26979,61.71,0.04,234204.0
04 - Get Static Users,50,4,3,9,1.19,0.000%,.26978,0.13,0.04,500.0
05 - Get Conversations,50,48,43,55,2.57,0.000%,.26971,0.17,0.04,650.6
06 - Get Messages,50,136,121,179,8.94,0.000%,.26957,2.35,0.05,8930.8
07 - Send Message,50,140,126,279,20.39,0.000%,.26957,0.07,0.07,247.0
TOTAL,350,49,3,279,58.36,0.000%,1.59562,93.52,0.26,60017.5