performance-testing/summary_light_optimized.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
01 - Load Homepage,50,6,4,42,5.24,0.000%,.26993,0.27,0.03,1037.0
02 - Load React Bundle,50,6,5,13,1.36,0.000%,.26998,46.02,0.04,174553.0
03 - Load CSS Bundle,50,7,5,13,1.90,0.000%,.27001,61.76,0.04,234204.0
04 - Get Static Users,50,4,3,8,0.94,0.000%,.27002,0.14,0.04,523.0
05 - Get Conversations,50,41,34,53,4.15,0.000%,.26999,0.18,0.04,675.0
06 - Get Messages,50,152,130,178,13.46,0.000%,.26987,1.77,0.05,6698.0
07 - Send Message,50,119,101,140,9.54,0.000%,.26992,0.07,0.07,270.0
TOTAL,350,48,3,178,57.89,0.000%,1.59694,93.12,0.26,59708.6